{
  "architectures": [
    "BailingMM2NativeForConditionalGeneration"
  ],
  "audio_config": {
    "_name_or_path": "",
    "add_cross_attention": false,
    "architectures": null,
    "bad_words_ids": null,
    "begin_suppress_tokens": null,
    "bos_token_id": null,
    "chunk_size_feed_forward": 0,
    "cross_attention_hidden_size": null,
    "decoder_start_token_id": null,
    "diversity_penalty": 0.0,
    "do_sample": false,
    "ds_kernel_size": 3,
    "ds_stride": 2,
    "early_stopping": false,
    "encoder_no_repeat_ngram_size": 0,
    "eos_token_id": null,
    "exponential_decay_length_penalty": null,
    "finetuning_task": null,
    "forced_bos_token_id": null,
    "forced_eos_token_id": null,
    "id2label": {
      "0": "LABEL_0",
      "1": "LABEL_1"
    },
    "is_decoder": false,
    "is_encoder_decoder": false,
    "label2id": {
      "LABEL_0": 0,
      "LABEL_1": 1
    },
    "length_penalty": 1.0,
    "max_length": 20,
    "min_length": 0,
    "model_type": "",
    "no_repeat_ngram_size": 0,
    "num_beam_groups": 1,
    "num_beams": 1,
    "num_return_sequences": 1,
    "output_attentions": false,
    "output_hidden_states": false,
    "output_scores": false,
    "pad_token_id": null,
    "prefix": null,
    "problem_type": null,
    "pruned_heads": {},
    "remove_invalid_values": false,
    "repetition_penalty": 1.0,
    "return_dict": true,
    "return_dict_in_generate": false,
    "sep_token_id": null,
    "suppress_tokens": null,
    "task_specific_params": null,
    "temperature": 1.0,
    "tf_legacy_loss": false,
    "tie_encoder_decoder": false,
    "tie_word_embeddings": true,
    "tokenizer_class": null,
    "top_k": 50,
    "top_p": 1.0,
    "torch_dtype": null,
    "torchscript": false,
    "typical_p": 1.0,
    "use_bfloat16": false,
	"norm_query_embeds": true,
    "whisper_encoder_config": {
      "n_ctx": 15000,
      "n_head": 20,
      "n_layer": 32,
      "n_mels": 128,
      "n_state": 1280
    }
  },
  "llm_config": {
    "architectures": [
        "BailingMoeV2ForCausalLM"
    ],
    "attention_dropout": 0.0,
    "auto_map": {
        "AutoConfig": "configuration_bailing_moe_v2.BailingMoeV2Config",
        "AutoModel": "modeling_bailing_moe_v2.BailingMoeV2Model",
        "AutoModelForCausalLM": "modeling_bailing_moe_v2.BailingMoeV2ForCausalLM"
    },
    "eos_token_id": 156895,
    "pad_token_id": 156892,
    "first_k_dense_replace": 1,
    "hidden_act": "silu",
    "hidden_size": 4096,
    "image_patch_token": 157157,
    "video_patch_token": 157175,
    "image_start_token": 157158,
    "video_start_token": 157159,
    "initializer_range": 0.006,
    "intermediate_size": 9216,
    "max_position_embeddings": 32768,
    "model_type": "bailing_moe_v2",
    "moe_intermediate_size": 1024,
    "num_experts": 256,
    "router_type": "MultiRouter",
    "num_shared_experts": 1,
    "norm_topk_prob": true,
    "num_attention_heads": 32,
    "num_experts_per_tok": 8,
    "num_hidden_layers": 32,
    "num_key_value_heads": 4,
    "pretraining_tp": 1,
    "rms_norm_eps": 1e-06,
    "rope_scaling": {
      "factor": null,
      "type": "video_rope"
    },
    "rope_theta": 600000,
    "tie_word_embeddings": false,
    "torch_dtype": "bfloat16",
    "transformers_version": "4.53.0",
    "use_cache": true,
    "use_bias": false,
    "use_qkv_bias": false,
    "vocab_size": 157184,
    "output_router_logits": false,
    "use_qk_norm": true,
    "use_expert_bias": true,
    "embedding_dropout": 0.0,
    "norm_head": false,
    "norm_softmax": false,
    "output_dropout": 0.0,
    "partial_rotary_factor": 0.5,
    "topk_group": 4,
    "n_group": 8,
    "moe_router_topk_scaling_factor": 2.5
  },
  "mlp_depth": 2,
  "model_type": "bailingmm_moe_v2_lite",
  "torch_dtype": "bfloat16",
  "transformers_version": "4.53.0",
  "vision_config": {
    "_attn_implementation_autoset": true,
    "add_cross_attention": false,
    "architectures": [
      "Qwen2_5_VisionTransformer"
    ],
    "auto_map": {
      "AutoConfig": "configuration_qwen2_5_vit.Qwen2_5_VLVisionConfig",
      "AutoModel": "qwen2_5_vit.Qwen2_5_VisionTransformer"
    },
    "bad_words_ids": null,
    "begin_suppress_tokens": null,
    "bos_token_id": null,
    "chunk_size_feed_forward": 0,
    "cross_attention_hidden_size": null,
    "decoder_start_token_id": null,
    "depth": 32,
    "diversity_penalty": 0.0,
    "do_sample": false,
    "early_stopping": false,
    "encoder_no_repeat_ngram_size": 0,
    "eos_token_id": null,
    "exponential_decay_length_penalty": null,
    "finetuning_task": null,
    "forced_bos_token_id": null,
    "forced_eos_token_id": null,
    "fullatt_block_indexes": [
      7,
      15,
      23,
      31
    ],
    "hidden_act": "silu",
    "hidden_size": 1280,
    "id2label": {
      "0": "LABEL_0",
      "1": "LABEL_1"
    },
    "in_channels": 3,
    "in_chans": 3,
    "intermediate_size": 3456,
    "is_decoder": false,
    "is_encoder_decoder": false,
    "label2id": {
      "LABEL_0": 0,
      "LABEL_1": 1
    },
    "length_penalty": 1.0,
    "max_length": 20,
    "min_length": 0,
    "model_type": "qwen2_5_vit",
    "no_repeat_ngram_size": 0,
    "num_beam_groups": 1,
    "num_beams": 1,
    "num_heads": 16,
    "num_return_sequences": 1,
    "out_hidden_size": 8192,
    "output_attentions": false,
    "output_hidden_states": false,
    "output_scores": false,
    "pad_token_id": null,
    "patch_size": 14,
    "prefix": null,
    "problem_type": null,
    "pruned_heads": {},
    "remove_invalid_values": false,
    "repetition_penalty": 1.0,
    "return_dict": true,
    "return_dict_in_generate": false,
    "sep_token_id": null,
    "spatial_merge_size": 2,
    "spatial_patch_size": 14,
    "suppress_tokens": null,
    "task_specific_params": null,
    "temperature": 1.0,
    "temporal_patch_size": 2,
    "tf_legacy_loss": false,
    "tie_encoder_decoder": false,
    "tie_word_embeddings": true,
    "tokenizer_class": null,
    "tokens_per_second": 2,
    "top_k": 50,
    "top_p": 1.0,
    "torch_dtype": "bfloat16",
    "torchscript": false,
    "typical_p": 1.0,
    "use_bfloat16": false,
    "window_size": 112
  }
}
